{"player name": "Rick", "npc name": "Nancy", "npc persona": "Nancy is a hunter in Minecraft. She has a barrage of information regarding the location of wolves and foxes in the tropical rainforest. She is also so friendly as to help fight them off without asking for anything in return.", "player persona": "Rick has been playing Minecraft since childhood but has never explored the forest. He encounters foxes as he gathers bamboo and quickly asks the NPC for help. He gets upset when he learns that he has to attack the foxes at close quarters as he isn't a fan of combat.", "scene": "Nancy lives near the tropical rainforest in a hunter’s hut with an admirable collection of trophies. She also has a few chests full of weapons and armor that she doesn’t mind sharing with players who need help.", "conversation": "Rick: Uh… hello?\nFunction call: Call Greetings\nNancy: Oh, hello! Didn’t see you in the dark at first, haha!\nRick: Sorry, I’m in a bit of a hurry… running away from the foxes in the forest…\nFunction call: Call nothing\nNancy: Ah, those pesky little things, I know all about them! My name’s Nancy and I’m a hunter and survivor!\nRick: In that case I’ve come to the right place! I’m Rick and I’ve stumbled on a pack of foxes for the first time…\nFunction call: Call nothing\nNancy: Nice to meet you, Rick! And don’t be afraid, foxes usually avoid people, unless you atack them.\nRick: I was just collecting some bamboo and it seems that I disturbed them…\nFunction call: Call nothing\nNancy: Well, there are three ways to deal with foxes: avoid them, run away from them or attack them.\nRick: I’m not a fan of combat…\nFunction call: Call nothing\nNancy: A pacifist, eh? Then I guess you’re not carrying any weapons with you?\nRick: I have a sword with me… I only use it to cut bamboo.\nFunction call: Call open a chest\nNancy: Now I’m going to show you how to use the sword to fight foxes!\nRick: But like I said, I’m not really into fighting…\nFunction call: Call nothing\nNancy: If you want bamboo from a tropical rainforest biome, I’d say you have no choice.\nRick: Okay… Can you help me to fight them off?\nFunction call: Call take item from the chest on sword\nNancy: Of course, it’s what I do for living! Now follow me and we’ll get you that bamboo!\nFunction call: Call Follow the player\nNancy: We’re close to the foxes’ hideout! Before we attack them, keep in mind that foxes are nocturnal and therefore more active at night. They’re quite fast, as you may have already noticed, and they attack either by running up to the target, or by pouncing.\nRick: They were running up to me, but I haven’t seen them pouncing?\nFunction call: Call nothing\nNancy: When a fox prepares to pounce it tilts and lowers its head, and lowers its body to become shorter. Then it leaps 2–5 blocks into the  at a target, jumping over  and  if needed!\nRick: Wow, they seem quite powerful…\nFunction call: Call nothing\nNancy: Not really, they’re a lot weaker than wolves and polar bears. But enough talking, let’s fight these creatures of the night!\nFunction call: Call attack on fox\nNancy: Ha, they’re no match for a seasoned hunter such as myself!\nRick: I also helped a bit…\nFunction call: Call drop item function on Egg\nNancy: Of course, Rick, and here is your prize!\nRick: Oh, thanks!\nFunction call: Call nothing\nNancy: Don’t mention it! Foxes always drop any item they pick up and are still holding when you defeat them. This one was carrying a tasty egg that’s yours to keep.\nRick: I really appreciate your help, Nancy! I’m going to cut some bamboo for myself.\nFunction call: Call End Conversation\nNancy: See you soon, Rick! Stay safe in your adventures!\n"}